zeruns/STM32F407_LVGL_Template_MSP3526/MDK-ARM/.pack/Keil/STM32F4xx_DFP.2.14.0/MDK/Boards/ST/STM32F429I-Discovery/emWin/GUIDemo/RTE/Graphics_Display/STM32F429ZITx/LCDConf.c
  while (NumItems >= 4) {
    Color = *(pColorSrc + 0);
    Color ^= 0xFF000000;      // Invert alpha
    *(pColorDst + 0) = Color;
    Color = *(pColorSrc + 1);
    Color ^= 0xFF000000;      // Invert alpha
    *(pColorDst + 1) = Color;
    Color = *(pColorSrc + 2);
    Color ^= 0xFF000000;      // Invert alpha
    *(pColorDst + 2) = Color;
    Color = *(pColorSrc + 3);
    Color ^= 0xFF000000;      // Invert alpha
    *(pColorDst + 3) = Color;
    pColorSrc += 4;
    pColorDst += 4;
    NumItems -= 4;
  }
  while (NumItems--) {
    Color = *pColorSrc++;
    *pColorDst++ = Color ^ 0xFF000000; // Invert alpha
  };
}

/*********************************************************************
*
*       _InvertAlpha_MOD
*
* Purpose:
*   Color format of DMA2D is different to emWin color format. This routine
*   inverts alpha that it is compatible to emWin and vice versa.
*   Changes are done in the given buffer.
*
* Performance:
*   18.0 MPixel/s
*/
static void _InvertAlpha_MOD(LCD_COLOR * pColor, U32 NumItems) {
  U32 Color;

  while (NumItems >= 4) {
    Color = *(pColor + 0);
    Color ^= 0xFF000000; // Invert alpha
    *(pColor + 0) = Color;
    Color = *(pColor + 1);
    Color ^= 0xFF000000; // Invert alpha
    *(pColor + 1) = Color;
    Color = *(pColor + 2);
    Color ^= 0xFF000000; // Invert alpha
    *(pColor + 2) = Color;
    Color = *(pColor + 3);
    Color ^= 0xFF000000; // Invert alpha
    *(pColor + 3) = Color;
    pColor += 4;
    NumItems -= 4;
  }
  while (NumItems--) {
    Color = *pColor;
    Color ^= 0xFF000000; // Invert alpha
    *pColor++ = Color;
  };
}
#endif

/*********************************************************************
*
*       _DMA_AlphaBlending
*/
static void _DMA_AlphaBlending(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U32 NumItems) {
#if (GUI_USE_ARGB)
  //
  // Use DMA2D for mixing
  //
  _DMA_AlphaBlendingBulk(pColorFG, pColorBG, pColorDst, NumItems);
#else
  //
  // Invert alpha values
  //
  _InvertAlpha_CPY(pColorFG, _pBuffer_FG, NumItems);
  _InvertAlpha_CPY(pColorBG, _pBuffer_BG, NumItems);
  //
  // Use DMA2D for mixing
  //
  _DMA_AlphaBlendingBulk(_pBuffer_FG, _pBuffer_BG, pColorDst, NumItems);
  //
  // Invert alpha values
  //
  _InvertAlpha_MOD(pColorDst, NumItems);
#endif
}

/*********************************************************************
*
*       _DMA_Index2ColorBulk
*
* Purpose:
*   This routine is used by the emWin color conversion routines to use DMA2D for
*   color conversion. It converts the given index values to 32 bit colors.
*   Because emWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
*   transparent the color array needs to be converted after DMA2D has been used.
*/
static void _DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat) {
  GUI_USE_PARA(SizeOfIndex);

#if (GUI_USE_ARGB)
  //
  // Use DMA2D for the conversion
  //
  _DMA_ConvertColor(pIndex, pColor, PixelFormat, LTDC_PIXEL_FORMAT_ARGB8888, NumItems);
#else
  //
  // Use DMA2D for the conversion
  //
  _DMA_ConvertColor(pIndex, pColor, PixelFormat, LTDC_PIXEL_FORMAT_ARGB8888, NumItems);
  //
  // Convert colors from ARGB to ABGR and invert alpha values
  //
  _InvertAlpha_SwapRB_MOD(pColor, NumItems);
#endif
}

/*********************************************************************
*
*       _DMA_Color2IndexBulk
*
* Purpose:
*   This routine is used by the emWin color conversion routines to use DMA2D for
*   color conversion. It converts the given 32 bit color array to index values.
*   Because emWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
*   transparent the given color array needs to be converted before DMA2D can be used.
*/
static void _DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat) {
  GUI_USE_PARA(SizeOfIndex);

#if (GUI_USE_ARGB)
  //
  // Use DMA2D for the conversion
  //
  _DMA_ConvertColor(pColor, pIndex, LTDC_PIXEL_FORMAT_ARGB8888, PixelFormat, NumItems);
#else
  //
  // Convert colors from ABGR to ARGB and invert alpha values
  //
  _InvertAlpha_SwapRB_CPY(pColor, _pBuffer_DMA2D, NumItems);
  //
  // Use DMA2D for the conversion
  //
  _DMA_ConvertColor(_pBuffer_DMA2D, pIndex, LTDC_PIXEL_FORMAT_ARGB8888, PixelFormat, NumItems);
#endif
}

/*********************************************************************
*
*       _LCD_MixColorsBulk
*/
static void _LCD_MixColorsBulk(U32 * pFG, U32 * pBG, U32 * pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) {
#if (GUI_USE_ARGB)
  unsigned int y;

  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  for (y = 0; y < ySize; y++) {
    //
    // Use DMA2D for mixing up
    //
    _DMA_MixColorsBulk(pFG, pBG, pDst, Intens, xSize);
    pFG  += xSize + OffFG;
    pBG  += xSize + OffBG;
    pDst += xSize + OffDest;
  }
#else
  unsigned int y;

  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  for (y = 0; y < ySize; y++) {
    //
    // Invert alpha values
    //
    _InvertAlpha_CPY(pFG, _pBuffer_FG, xSize);
    _InvertAlpha_CPY(pBG, _pBuffer_BG, xSize);
    //
    // Use DMA2D for mixing up
    //
    _DMA_MixColorsBulk(_pBuffer_FG, _pBuffer_BG, pDst, Intens, xSize);
    //
    // Invert alpha values
    //
    _InvertAlpha_MOD(pDst, xSize);
    pFG  += xSize + OffFG;
    pBG  += xSize + OffBG;
    pDst += xSize + OffDest;
  }
#endif
}

/*********************************************************************
*
*       ILI934 Registers
*
*********************************************************************
*/
#define ILI9341_SLEEP_OUT       0x11    // Sleep out register
#define ILI9341_GAMMA           0x26    // Gamma register
#define ILI9341_DISPLAY_OFF     0x28    // Display off register
#define ILI9341_DISPLAY_ON      0x29    // Display on register
#define ILI9341_COLUMN_ADDR     0x2A    // Column address register
#define ILI9341_PAGE_ADDR       0x2B    // Page address register
#define ILI9341_GRAM            0x2C    // GRAM register
#define ILI9341_MAC             0x36    // Memory Access Control register
#define ILI9341_PIXEL_FORMAT    0x3A    // Pixel Format register
#define ILI9341_WDB             0x51    // Write Brightness Display register
#define ILI9341_WCD             0x53    // Write Control Display register
#define ILI9341_RGB_INTERFACE   0xB0    // RGB Interface Signal Control
#define ILI9341_FRC             0xB1    // Frame Rate Control register
#define ILI9341_BPC             0xB5    // Blanking Porch Control register
#define ILI9341_DFC             0xB6    // Display Function Control register
#define ILI9341_POWER1          0xC0    // Power Control 1 register
#define ILI9341_POWER2          0xC1    // Power Control 2 register
#define ILI9341_VCOM1           0xC5    // VCOM Control 1 register
#define ILI9341_VCOM2           0xC7    // VCOM Control 2 register
#define ILI9341_POWERA          0xCB    // Power control A register
#define ILI9341_POWERB          0xCF    // Power control B register
#define ILI9341_PGAMMA          0xE0    // Positive Gamma Correction register
#define ILI9341_NGAMMA          0xE1    // Negative Gamma Correction register
#define ILI9341_DTCA            0xE8    // Driver timing control A
#define ILI9341_DTCB            0xEA    // Driver timing control B
#define ILI9341_POWER_SEQ       0xED    // Power on sequence register
#define ILI9341_3GAMMA_EN       0xF2    // 3 Gamma enable register
#define ILI9341_INTERFACE       0xF6    // Interface control register
#define ILI9341_PRC             0xF7    // Pump ratio control register

#define ILI9341_WriteReg(reg)   LCD_X_Write0_8(reg)
#define ILI9341_WriteData(data) LCD_X_Write1_8(data)

/*********************************************************************
*
*       _InitIL9341
*
* Purpose:
*   Initializes the IL9341 controller
*/
static void _InitIL9341(void) {

  /* Configure LCD */
  ILI9341_WriteReg (0xCA);
  ILI9341_WriteData(0xC3);
  ILI9341_WriteData(0x08);
  ILI9341_WriteData(0x50);
  ILI9341_WriteReg (ILI9341_POWERB);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0xC1);
  ILI9341_WriteData(0x30);
  ILI9341_WriteReg (ILI9341_POWER_SEQ);
  ILI9341_WriteData(0x64);
  ILI9341_WriteData(0x03);
  ILI9341_WriteData(0x12);
  ILI9341_WriteData(0x81);
  ILI9341_WriteReg (ILI9341_DTCA);
  ILI9341_WriteData(0x85);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x78);
  ILI9341_WriteReg (ILI9341_POWERA);
  ILI9341_WriteData(0x39);
  ILI9341_WriteData(0x2C);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x34);
  ILI9341_WriteData(0x02);
  ILI9341_WriteReg (ILI9341_PRC);
  ILI9341_WriteData(0x20);
  ILI9341_WriteReg (ILI9341_DTCB);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteReg (ILI9341_FRC);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x1B);
  ILI9341_WriteReg (ILI9341_DFC);
  ILI9341_WriteData(0x0A);
  ILI9341_WriteData(0xA2);
  ILI9341_WriteReg (ILI9341_POWER1);
  ILI9341_WriteData(0x10);
  ILI9341_WriteReg (ILI9341_POWER2);
  ILI9341_WriteData(0x10);
  ILI9341_WriteReg (ILI9341_VCOM1);
  ILI9341_WriteData(0x45);
  ILI9341_WriteData(0x15);
  ILI9341_WriteReg (ILI9341_VCOM2);
  ILI9341_WriteData(0x90);
  ILI9341_WriteReg(ILI9341_MAC);
  ILI9341_WriteData(0xC8);
  ILI9341_WriteReg (ILI9341_3GAMMA_EN);
  ILI9341_WriteData(0x00);
  ILI9341_WriteReg (ILI9341_RGB_INTERFACE);
  ILI9341_WriteData(0xC2);
  ILI9341_WriteReg (ILI9341_DFC);
  ILI9341_WriteData(0x0A);
  ILI9341_WriteData(0xA7);
  ILI9341_WriteData(0x27);
  ILI9341_WriteData(0x04);

  /* Column address set */
  ILI9341_WriteReg (ILI9341_COLUMN_ADDR);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0xEF);

  /* Page address set */
  ILI9341_WriteReg (ILI9341_PAGE_ADDR);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x01);
  ILI9341_WriteData(0x3F);
  ILI9341_WriteReg (ILI9341_INTERFACE);
  ILI9341_WriteData(0x01);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x06);

  ILI9341_WriteReg (ILI9341_GRAM);
  GUI_Delay(200);

